starter-kit-site-lisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Starter Kit Site Lisp</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" href="stylesheets/styles.css">
                <link rel="stylesheet" href="stylesheets/org-pygments.css">
</head>
<body>
<div id="content">
<h1 class="title">Starter Kit Site Lisp</h1>
<p>
This is part of the <a href="starter-kit.html">Emacs Starter Kit</a>.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Starter Kit Site Lisp</h2>
<div class="outline-text-2" id="text-1">
<p>
The purpose of this code is to download, if necessary, missing lisp code that
can not be retrieved through ELPA package. Maybe this can be better done using
<a href="https://github.com/dimitri/el-get">el-get</a> package. No update mechanism is implemented but in the same time, the
packages retrieved this way are not fashion enough (otherwise there have been
added to melpa).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Download code</h3>
<div class="outline-text-3" id="text-1-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span class="org-keyword">defun</span> <span class="org-function-name">install-site-lisp-file</span> (package urls)
  <span class="org-doc">"Function to get a remote lisp file."</span>
  (<span class="org-keyword">let</span> (dir file)
    (setq dir (concat starter-kit-lisp-directory package <span class="org-string">"/"</span>))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Make sure the directory exists and add it to the load path</span>
    (make-directory dir t)
    (add-to-list 'load-path dir)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Loop over urls</span>
    (<span class="org-keyword">while</span> urls
      (<span class="org-keyword">let</span> (url file)
        (setq url (pop urls))
        (setq file (concat dir (file-name-nondirectory url)))
        (message <span class="org-string">"URL %s"</span> file)
        (<span class="org-keyword">when</span> (not (file-exists-p file))
          (url-copy-file url file t))))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">External Lisp files</h3>
<div class="outline-text-3" id="text-1-2">
</div><div id="outline-container-sec-1-2-1" class="outline-4">
<h4 id="sec-1-2-1">trac-wiki</h4>
<div class="outline-text-4" id="text-1-2-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(install-site-lisp-file
 <span class="org-string">"trac-wiki"</span>
 (list <span class="org-string">"https://raw.github.com/tiborsimko/trac-wiki-el/master/trac-wiki.el"</span>))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-2-2" class="outline-4">
<h4 id="sec-1-2-2">inertial-scroll</h4>
<div class="outline-text-4" id="text-1-2-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(install-site-lisp-file
 <span class="org-string">"inertial-scroll"</span>
 (list
 <span class="org-string">"https://raw.github.com/kiwanami/emacs-inertial-scroll/master/inertial-scroll.el"</span>
 <span class="org-string">"https://raw.github.com/kiwanami/emacs-deferred/master/concurrent.el"</span>
 <span class="org-string">"https://raw.github.com/kiwanami/emacs-deferred/master/deferred.el"</span>))
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
File under git version control - commit cdc7aca - 2013-12-18
</div>
</body>
</html>
